contactsimonwilson/floatwheel/ADV2/BMS/Library/Nationstech.N32L40x_Library.1.2.2/projects/n32l40x_EVAL/examples/LPUART/HardwareFlowCtrl/HardwareFlowCtrl/inc/main.h
/*****************************************************************************
 * Copyright (c) 2022, Nations Technologies Inc.
 *
 * All rights reserved.
 * ****************************************************************************
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * - Redistributions of source code must retain the above copyright notice,
 * this list of conditions and the disclaimer below.
 *
 * Nations' name may not be used to endorse or promote products derived from
 * this software without specific prior written permission.
 *
 * DISCLAIMER: THIS SOFTWARE IS PROVIDED BY NATIONS "AS IS" AND ANY EXPRESS OR
 * IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE
 * DISCLAIMED. IN NO EVENT SHALL NATIONS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
 * LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA,
 * OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF
 * LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING
 * NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 * ****************************************************************************/

/**
 * @file main.h
 * @author Nations
 * @version V1.2.2
 *
 * @copyright Copyright (c) 2022, Nations Technologies Inc. All rights reserved.
 */
#ifndef __MAIN_H__
#define __MAIN_H__

#ifdef __cplusplus
extern "C" {
#endif

#include "n32l40x.h"

#define _LPUART_USART2_

#ifdef _LPUART_USART2_
#define LPUART_GPIO       GPIOB
#define LPUART_GPIO_CLK   RCC_APB2_PERIPH_GPIOB
#define LPUART_RxPin      GPIO_PIN_11
#define LPUART_TxPin      GPIO_PIN_10
#define LPUART_RTSPin      GPIO_PIN_12
#define LPUART_CTSPin      GPIO_PIN_13
#define LPUART_Rx_GPIO_AF GPIO_AF4_LPUART
#define LPUART_Tx_GPIO_AF GPIO_AF4_LPUART
#define LPUART_RTS_GPIO_AF GPIO_AF2_LPUART
#define LPUART_CTS_GPIO_AF GPIO_AF4_LPUART

#define USARTz             USART2
#define USARTz_GPIO        GPIOA
#define USARTz_CLK         RCC_APB1_PERIPH_USART2
#define USARTz_GPIO_CLK    RCC_APB2_PERIPH_GPIOA
#define USARTz_RxPin       GPIO_PIN_3
#define USARTz_TxPin       GPIO_PIN_2
#define USARTz_RTSPin      GPIO_PIN_1
#define USARTz_CTSPin      GPIO_PIN_0
#define USARTz_Rx_GPIO_AF  GPIO_AF4_USART2
#define USARTz_Tx_GPIO_AF  GPIO_AF4_USART2
#define USARTz_RTS_GPIO_AF GPIO_AF4_USART2
#define USARTz_CTS_GPIO_AF GPIO_AF4_USART2
#define USARTz_APBxClkCmd RCC_EnableAPB1PeriphClk
#define USARTz_IRQn       USART2_IRQn
#define USARTz_IRQHandler USART2_IRQHandler
#endif

typedef enum
{
    FAILED = 0,
    PASSED = !FAILED
} TestStatus;

void RCC_Configuration(uint32_t LPUART_CLK_SRC);
void GPIO_Configuration(void);
void NVIC_Configuration(void);
TestStatus Buffercmp(uint8_t* pBuffer1, uint8_t* pBuffer2, uint16_t BufferLength);
void Delay(__IO uint32_t nCount);

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H__ */
